app/controllers/stories_controller.rb

SELECT "sprints".* FROM "sprints"
---
  def index
    @stories = Story.all.order(:position)
    @sprints = Sprint.all

SELECT "sprints".* FROM "sprints"
---
  def new
    @story = Story.new
    @sprints = Sprint.all

SELECT "sprints".* FROM "sprints"
---
  def edit
    set_story
    @sprints = Sprint.all

SELECT  "stories".* FROM "stories" WHERE "stories"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def sort
    params[:story].each_with_index do |id, index|
     Story.where(id: id).update_all(position: index + 1)

INSERT INTO "stories" ("name", "description", "label", "complete", "created_at", "updated_at", "sprint_id") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "s004"], ["description", ""], ["label", ""], ["complete", "f"], ["created_at", "2018-01-18 11:52:52.577846"], ["updated_at", "2018-01-18 11:52:52.577846"], ["sprint_id", 1]]
---
  def create
    @story = Story.new(story_params)

    respond_to do |format|
      if @story.save

UPDATE "stories" SET "complete" = ?, "sprint_id" = ?, "updated_at" = ? WHERE "stories"."id" = ?  [["complete", "t"], ["sprint_id", 1], ["updated_at", "2018-01-18 01:49:00.690502"], ["id", 3]]
---
  def update
    set_story
    respond_to do |format|
      if @story.update(story_params)

DELETE FROM "stories" WHERE "stories"."id" = ?  [["id", 4]]
---
  def destroy
    set_story
    @story.destroy

SELECT  "stories".* FROM "stories" WHERE "stories"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
  def set_story
    @story = Story.find(params[:id])